fun main(){

    println("""
        ☆ᕱ___ᕱ
       ପ(„• ༝ •„)ଓ
         ┏━∪∪━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
              Bem-vindo ao Simulador de Animal de Estimação Virtual!
    """.trimIndent())
    println(" ")
    println("""
        Adote um dos seguintes bichinhos:
        Digite 1: Panda🐼
        Digite 2: Pato🦆
        Digite 3: Gato🐱
        Digite 4: Coelho🐰
        Digite 5: Cachorro🐶
    """.trimIndent()) //escolher com que animalzinho jogar
    val escolherBichinho=readln().toIntOrNull()

    when(escolherBichinho){//verifica escolha do jogador e mostra o bichinho
        1->{
           println("Animalzinho escolhido: Panda🐼")
            println("""
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⣿⣿⣿⣿⣷⡀⣀⣠⡤⠤⠤⠤⠤⠤⣄⣀⡀⣴⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⠟⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⢿⣿⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⢿⡿⠁⠀⠀⠀⣠⣤⣤⣄⠀⠀⠀⠀⢠⣤⣤⣄⡀⠀⠀⠀⢻⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⠃⠀⠀⢀⣾⣿⣿⣿⡟⣀⣀⣀⣀⢸⣿⣿⣿⣷⡄⠀⠀⠀⣧⡀⣀⡀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⢀⣀⡀⡟⠀⠀⠀⢸⣿⣿⣿⡏⠘⢿⣿⣿⣿⠏⠙⣿⣿⣿⡇⢀⣴⣾⡿⢿⡿⢿⣶⣦⡀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⣴⣾⣿⣿⣿⣿⣶⣄⠀⠀⠻⣿⠿⠃⠠⣀⣨⣏⣀⡀⠀⠻⠿⡿⠁⢸⣿⣹⡷⠿⠿⢿⣍⣿⡇⠀⠀⠀⠀
                ⣀⣀⣀⣀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣧⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣀⣘⣿⣿⣄⣀⣀⣀⣿⣿⣇⣀⣀⣀⣤
                ⠀⠀⠀⠀⠘⠿⢿⣿⣿⣿⣿⣿⠿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            """.trimIndent())
        }
        2->{
            println("Animalzinho escolhido: Pato🦆")
            println("""
                ⠀⠀⠀⢀⡤⠚⠉⠉⠉⠉⠉⠲⢤⡀⠀⠀⠀⠀⠀⠀
                ⠀⠀⡰⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣄⠀⠀⠀⠀⠀
                ⠀⢰⠁⠀⠀⠀⠀⠀⣀⠀⠀⢀⣄⡀⠈⠳⡀⠀⠀⠀
                ⠀⢸⠀⠀⣀⡀⢀⠞⠀⠙⣒⠄⠀⠀⠀⠀⣷⠖⠲⡀
                ⠀⣮⠀⠈⠋⠀⠘⠒⠋⠉⠀⠀⠀⠀⠀⡰⠃⠀⠀⣇
                ⠀⢫⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢴⠁
                ⡏⠉⠙⠒⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡤⠤⢤⠈⣆
                ⠳⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⢨⢇⠟
                ⠀⠀⠙⡅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠢⠔⣋⠞⠀
                ⠀⠀⠀⠘⠦⡀⠀⠀⠀⠀⠀⠀⢀⣀⡤⠔⠋⠀⠀⠀
                ⠀⠀⠀⠀⠀⠈⠙⡖⠒⠒⠒⡏⠁⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠣⠤⠤⠟⠃⠀⠀⠀⠀⠀⠀⠀⠀
            """.trimIndent())
        }
        3->{
            println("Animalzinho escolhido: Gato🐱")
            println("""
                ⠀⠀⠀⠀⠀⠀⣠⣶⣶⢶⣶⣶⣶⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣤⣀⡀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⢰⡿⠃⠀⠀⠀⠀⠀⠉⠙⢻⣦⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣀⠀⢀⣠⣶⠿⠛⠉⠉⠙⣿⡄⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠩⠉⠈⠇⠀⠀  ⠀⠈⠉⠉⠛⠻⠟⠋⠁⠀⠀⠀⠀⠀  ⣿⡇⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⢸⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⢀⣿⠃⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠈⣿⠆⠀⠀⠀⠀⠀⠀⠀⠀⠀         ⠀  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⢸⡟⠀⠀⠀⠀⠀⠀
                ⠀⣀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣶⣶⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀   ⠀⣿⠃⠀⠀⠀⠀⠀⠀
                ⠀⠛⠿⢶⣤⣄⠀⢀⣴⡟⠋⠉⠉⠙⣿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣶⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⢀⣠⣴⡆⠀
                ⠀⠀⠀⠀⠈⠉⠀⣾⣿⣧⠀⠀⠀⣠⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⣰⣿⣿⠋⠁⠀⠀⠈⣿⣿⣿⡆⠰⡿⠟⠋⠁⠀⠀
                ⢠⣴⣦⣤⣤⡀⠀⣿⣿⣿⣶⣶⣶⣿⣿⣿⣿⣿⣷⠀⠀⢀⣿⣿⣿⣿⣄⡀⠀⣀⣰⣿⣿⣿⡇⠀⠁⠀⠀⠀⠀⠀
                ⠀⠀⠀⠉⠉⠁⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠶⠶⠶⠶⠶⠆
                ⠀⠀⠀⠀⠀⠀⠆⠀⣿⣹⣿⣿⣿⣿⣿⣧⣿⣿⠟⠀⠀⠀⠀⠀⢹⣿⣿⣿⣿⣿⣻⣿⣿⣿⡿⠟⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣾⣍⣛⠿⠿⠿⠛⠁⠀⠀⠀⠀⠀⠀⠀⠙⠿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⣷⣶⣶⣶⣶⣤⣤⣤⣤⣤⣴⣶⣶⡶⠿⠟⠛⠛⠋⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣶⠀⠀⠀⠀⠈⠁⠉⠀⣠⣽⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⡀⢀⣤⣤⣤⣤⠀⣸⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠿⠿⠋⠁⠀⠛⠿⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            """.trimIndent())
        }
        4->{
            println("Animalzinho escolhido: Coelho🐰")
            println("""
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⠖⢶⡄⠀⠀⢀⣴⢦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠞⠋⠀⠀⠀⡿⠀⠀⡟⠀⠀⡘⢳⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⡏⠀⠀⠀⠀⢠⡇⠀⢸⠃⠀⢀⡇⠈⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⢰⠇⠀⠀⠀⠀⠀⡾⠀⢀⡞⠀⠀⢸⠁⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⡿⠀⠀⠀⠀⠀⢰⠇⢀⡞⠁⠀⠀⡿⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠉⠁⣾⣠⠏⠀⠀⠀⢰⡇⠀⠀⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠧⢀⣠⣤⠤⠒⠛⠛⣤⡀⠀⠒⠌⣿⠂⣸⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⣸⠿⠋⠁⠀⠀⠀⠀⠀⠀⠙⠒⠂⠰⠿⣔⣯⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⢀⡾⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⣠⡞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⡀⠀⠸⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⢠⡞⠁⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣽⡇⠀⠀⠛⢷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⢀⡾⠀⠀⠀⠀⠀⢰⡀⠀⣠⡀⠀⠀⠀⠀⠀⠀⠻⠿⠃⠀⠀⠀⠀⠹⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⢸⡇⠀⠀⠀⠀⠀⠀⢻⡾⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⢻⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⢸⡇⠀⠀⠀⠀⠀⠀⠛⠙⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠈⢿⣄⠀⠀⠀⠀⠀⠄⠒⠒⠤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⢀⡾⢙⠓⠶⠶⠶⠒⠋⠙⠓⠒⠧⢤⣄⣀⠀⠀⠀⠀⠀⢀⣀⣠⣾⠟⠉⢿⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⢸⢃⠀  ⠑⢦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠉⠉⠉⠉⠋⠉⠀⠀⠀⠀⢿⡿⣦⡀⠀⠀⠀⠀⠀⠀
                ⠀⠀
                
            """.trimIndent())
        }
        5->{
            println("Animalzinho escolhido: Cachorro🐶")
            println("""
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡴⠞⠛⠛⠲⢤⡀⢀⠤⢶⣄⠀⠀⠀⠀
                ⠀⠀⠀⠀⢀⡴⠶⣄⢠⠞⠁⠀⠀⠀⠀⠀⠀⠙⠋⢰⠀⠈⠢⢤⡀⠀
                ⠀⠠⡶⠚⠉⠀⣖⠊⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⡄⠀⠀⠀⠈⢆
                ⠀⠀⡆⠀⠀⠀⢹⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣄⠀⣧⠀⠀⠀⠀⡾
                ⠀⠀⣧⠀⠀⠀⠈⣷⠀⣠⣖⢦⠀⠀⠀⠀⢰⠓⡍⢧⢻⣧⠀⣠⠚⠀
                ⠀⠀⠸⣆⠀⠀⠀⢹⠀⣧⣨⡆⡇⠀⠀⠀⠸⣷⡇⡸⠀⡏⠉⠀⠀⠀
                ⠀⠀⠀⠈⠳⣄⢀⣧⡀⢻⣿⡡⠁⠀⠀⠀⠀⠙⠒⠣⣜⣀⢀⡀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠉⡀⠙⣶⡬⠀⠀⢠⣾⡟⠛⢻⠀⠀⢸⠁⠀⠙⠄⠀
                ⠀⠀⠀⠀⠀⠀⢸⡀⠀⠀⢳⣄⠀⠈⠿⢿⣒⣋⣀⣴⠇⠀⠀⠼⡀⠀
                ⠀⠀⠀⠀⢀⠤⠴⣧⣀⠀⠀⠉⠉⠉⠉⠉⠁⠈⠉⣁⣀⠀⠀⠀⢸⠀
                ⠀⠀⠀⢠⠃⠀⠀⠈⣇⠀⠀⢀⣤⡶⡶⢶⠛⠋⠉⠉⠉⠷⣤⡤⠂⠀
                ⠸⡄⠀⢸⡆⠀⠀⠀⠹⣷⣾⠟⠃⠀⡇⢸⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠰⡘⢤⣀⣿⡄⠀⠀⢠⡿⠧⣴⠀⠀⣷⡈⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠙⠲⠤⠭⣥⣤⣤⢽⣤⣶⣸⣤⣰⣌⣼⠾⠼⠀⠀⠀⠀⠀⠀⠀⠀
            """.trimIndent())
        }
    }
    println("Digite o nome do seu novo animalzinho:")//escolher nome
    val nomePet=readlnOrNull().orEmpty() ?: "Bananudo" // se o valor for null o programa coloca esse nome automaticamente
    val pet=BichinhoVirtual(nomePet)

    while(true){//menu
        println("\nEscolha uma ação:")
        println("1. Alimentar $nomePet🍼")
        println("2. Brincar com $nomePet🕹️")
        println("3. Levar $nomePet para dormir💤")
        println("4. Verificar o status de $nomePet💓")
        println("5. Sair👋")
        val escolha=readln().toIntOrNull() ?: continue //continua o código se a resposta n for um num

        when(escolha){//verifica escolha do jogador e chama a fun
            1->pet.alimentar()
            2->pet.brincar()
            3->pet.descansar()
            4->pet.verificarStatus()
            5->{
            println("Saindo do Simulador de Animal de Estimação Virtual. Até a próxima! ʚ₍ᐢ. ֑  .ᐢ₎ɞ")
            return
        }
            else->println("Escolha inválida. Tente novamente.")
        }

        pet.passarTempo() //simula o tempo que passa após cada ação
        if(pet.derrota()){
            return
        }
        if(pet.vitoria()){
            return
        }
    }

}